# Ensemble model that orchestrates the full routing pipeline:
# Input Text -> Preprocessor -> Router -> BLS Routing Logic -> Model (small/large) -> Output
#
# NOTE: This config defines the ensemble structure. The actual conditional
# routing logic is implemented in the BLS (Business Logic Scripting) model
# since Triton ensemble DAGs don't support conditional branching natively.

name: "router_ensemble"
platform: "ensemble"
max_batch_size: 0

input [
  {
    name: "INPUT_TEXT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "OUTPUT_TEXT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "ROUTING_INFO"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocessor"
      model_version: -1
      input_map {
        key: "INPUT_TEXT"
        value: "INPUT_TEXT"
      }
      output_map {
        key: "INPUT_IDS"
        value: "preprocessed_input_ids"
      }
      output_map {
        key: "ATTENTION_MASK"
        value: "preprocessed_attention_mask"
      }
    },
    {
      model_name: "router"
      model_version: -1
      input_map {
        key: "input_ids"
        value: "preprocessed_input_ids"
      }
      input_map {
        key: "attention_mask"
        value: "preprocessed_attention_mask"
      }
      output_map {
        key: "logits"
        value: "router_logits"
      }
    }
  ]
}
