name: "router"
platform: "tensorrt_plan"
max_batch_size: 8

input [
  {
    name: "FEATURES"
    data_type: TYPE_FP32
    dims: [ 10 ]
  }
]

output [
  {
    name: "LOGITS"
    data_type: TYPE_FP32
    dims: [ 2 ]
  }
]

dynamic_batching {
  preferred_batch_size: [ 4, 8, 16 ]
  max_queue_delay_microseconds: 5000
}

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]
